---
kind: other
id: Properties.T:Autodesk.Revit.DB.WallFoundationType
source: html/df333824-0cf8-5b4f-deba-96c56df67af0.htm
---
# WallFoundationType Properties

The id of the assembly instance to which the element belongs.